<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>블랙리스트</title>
</head>
<body>
	당신은 블랙리스트입니다@
</body>
</html>






1. ★ 메인페이지 css / 메뉴 카테고리 수정 css / 메뉴 카테고리 경로(list페이지로) 
2. ★ 메인페이지 데이터 불러오는 기능적인 부분 구현 필요_영준님 
3. ★ 메뉴 카테고리 경로(list페이지로) 





8. ★ 전문가 등록 - 체크박스 기능 없음
9. ★ 전문가 등록 - 태그 로직 없음(keyup, keydown할 때 유효성 검사를 계속 하는 걸 추천..)
10. ★ 전문가 등록 - 자격 > ajax로 select문
11. ★ 전문가 등록 - 유효성 검사
12. ★ 전문가 등록 - 상세 설명 input이 아닌 textarea or 섬머노트 등 다른 방식으로 구현 필요 > 구현 할 대권님과 협의 필요
13. ★ 전문가 등록 신청한 거 마이페이지에서 본인이 볼 수 없음, 따라서 기각사유 볼 수 없음
14. ★ 전문가 등록했는데 전문가 등록 메뉴가 헤드에 또 뜨는 거 > 상품등록으로 변경 필요
15. ★ 전문가 상담 등록 - 인증 받은 것만 카테고리만 등록할 수 있게
16. ★ 전문가 상담 등록 - 유효성 검사, required
17. ★ 전문가 상담 등록 - 태그 구분자
18. ★ 전문가 상담 등록 - nullpointerexception 에러 
19. ★ 전문가 상담 등록 - 등록 후 경로 파라미터가 이상해서 리스트가 안 뜨고 공백
22. ★ 전문가상담, 클래스, 지식마켓 할인율 입력 칸 추가 필요
31. ★ 마이페이지 - 후기 상세 경로

34. ★ 마이페이지 - 1:1 문의 유효성검사


30. ★ 구매하기 css는 했고 기능 구현 필요


37. ★ 1:1 상담 시간 버그
38. ★ 전문가 마이페이지, 회원 마이페이지 css
40. ★ 커뮤니티 - 게시물 좋아요 클릭 시 css 커서 포인터
41. ★ 커뮤니티 - 간단한 소개 글자 수 제한 없음.
44. ★ 관리자 페이지 - css


